app/controllers/authors_controller.rb

  def zero_authors_or_authenticated
    unless Author.count === 0 || current_user
---
SELECT COUNT(*) FROM "authors"